0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.4.1                                 |
|   \\  /    A nd           | Web:      http://www.openfoam.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

// Field Dictionary

FoamFile
{
    version         2.0;
    format          ascii;
    class           volVectorField;
    object          U;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //


dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (269.1066 14.3858 0);

boundaryField
{
   
    freestream
    {
        type 		freestreamVelocity;
        freestreamValue uniform (269.1066 14.3858 0);
    }
    sym
    {
        type 		symmetry;
    }
    wing
    {
        type 		noSlip;
    }
    
}


// ************************************************************************* //
