system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.1.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    "(rho|rhoU|rhoE)"
    {
        solver          diagonal;
    }

    "(U|e|k|epsilon|nuTilda)"
    {
        solver          GAMG;
        tolerance       1e-08;
        relTol          0.1;
        smoother        GaussSeidel;
        //nCellsInCoarsestLevel 20;
    }


    //U
    //{
    //    solver          smoothSolver;
    //    smoother        GaussSeidel;
    //    nSweeps         2;
    //    tolerance       1e-09;
    //    relTol          0.01;
    //}

    //h
    //{
    //    $U;
    //    tolerance       1e-10;
    //    relTol          0;
    //}

    //nuTilda
    //{
    //    solver          GAMG;
    //    tolerance       1e-08;
    //    relTol          0.1;
    //    smoother        GaussSeidel;
    //    nCellsInCoarsestLevel 20;

    //}

}


// ************************************************************************* //
